#ifndef INC_190928_UNIVERSITY_USES_THINGS_H
#define INC_190928_UNIVERSITY_USES_THINGS_H
#define TYPE_NAME(x) typeid(x).name()

#include <iostream>
#include <cstdio>
#include <cmath>
#include <algorithm>
#include <vector>
#include <string>
#include <map>
#include <typeinfo>

using namespace std;


//................................................ÂÀÐÈÀÍÒ_17.........................................................


vector<char> alphabet = {
        'א', 'ב', 'ג', 'ד', 'ה', 'ו', '¸', 'ז', 'ח', 'ט', 'י', 'ך', 'כ', 'ל',
        'ם', 'מ', 'ן', 'נ', 'ס', 'ע', 'ף', 'פ', 'ץ', 'צ', 'ק', 'ר', 'ש', 'ת',
        'û', 'ü', '‎', '‏', 'ÿ', ' ', ',', '.' };


string msg = R"(ך.אטזעתו.נט¸גלשףזיÿ‎‎לפףםםמכולשףךןדה¸פצרûנינ.רüגטחטכהןףגכםןןזסחגמ¸ד‎ט‏üסהננםשלרקלססלûפüגהז‏לזûד‎ה
ÿט‎טאûצ¸חך‎‏ יעהץ,יר‎עןםם‏¸אללרל.מ‎¸פזטמכ,גךלרגםםך‏רת‎ט‏ÿז‎אן,יחÿזבכ.טגûחüטקלרטהל‏¸אלרשהץדםזסזץ‏נןחûקגז‏הנ‎‎לשץהנ
סןי.כםהÿמכי.רז‏ÿםםזלשף.בזאר יי נטכ‏‏חג¸םנכטחףג תאגהלקוûנ,טךןקף נטנצלשניסזךכלםזמפ‏מף‎רזאט‏¸ר,זעהכז‎טכםףחÿםכנץץג ÿ,
ןûת‎גהננכטר¸גרס,‎‎חס  .דןראזץיננכ‎ןזציככג¸ר¸גיל‏ך לכיכחנ‎טןûצ¸.¸נררזעאÿא¸ÿרüגלכשמהןזזûמלבזנקףחÿםכי.‎פ¸הÿ‎ ,ץםûüנכ
ררז¸צךל‎¸ןזצ‏כלירףמנא,‏ךûלûנאדסûסרףג.הכשרÿתםûכדמךפ,ןאÿלמך רזטה‏תיתיטכםכ‎ט‏ûקיב,‎כףיץהך‏ךûל‏ץ‏לפנא,פםנÿגםûע‎עüÿנגי
‎עזףחף‎טאûצ¸חף‎כûיע‎ÿכ¸ד‏ץווÿאוקûזזûמיג¸ל‏ץ‏לפנא,פף,ם‏כלר יכ.‏מרתרסט.נךףüזנהץלירלסוûüנכר‏קגךםינןרץג,הלם‏רמזליזזרת
תילסÿ‎¸‏זצ‏כ‏כ¸לקם¸.ט‎¸פזסיג‏לז‎¸קק ‏פך‏זצחעק  .זי,ם‏.ריüףחÿנ דלקודתא  üרסûמלב‎רלי‎ןלמך‏כ û¸ז.כ.זזûכלמדסמדûל,ןûוי
גיצדךפלךףזûכ שלפגטהח‎ קםבםÿגכד.רץ‏ÿא‎ד‏קûאÿםגך רזלילאזלשףלס,‎¸ןüוף.‏ם וייםÿבכ‎פü,‎ÿ‏¸צû¸דûב‏.ז,פץאנדךפפחגכםןןזסגג
ךםדעûûעג¸ÿל, ףקיûב‏בזüי‎ט‎ü‎מפתןיבת‎טןסרחםאמדרÿהûל,‎¸ןüוףע‏כןפק,ûנזטפ‎ריûבםגןןüנאלזגרÿתףהזאכÿרüגחםי¸ךסיגחחמכוללףל
מלבכלשףחםי¸ו,¸הûםכ רÿרצםהםג¸‎רג ם¸.טןאואסןüרתזכהזכ¸ררזט‏¸ד‎‎‎רזקÿכ ןרקואס‏ל .דדûצדאזלרע‏ÿסה לםו לל‎¸פזטאך,טûמזפקה
מ‎ח עזיזזןר רצםםארולכףדזא ¸רמג,םןנÿןתבûי‏יז,פזהצ,ישלכצאÿמ י.תף,.כרשליגךהנüרÿתףלחנ‏רהüףÿת‏גואזץ‏זמגנרץםûמלזךרזע‏ÿא
כג‎‎הûלד‎ח‏ץרעחא‎טןסץאקדךבכחגךהנüר מ‎‏הנ‎¸ןזצזהגנצ¸עמûדדךפלשףוסז‎‎,üץאצ,ןפללףלעג טכחגךןזגאציאפהבכרסזסינט.כםזüםם.ר
רסגץ‏זזןפלמסמÿן.זץזכאך,ךבפזצזעו¸ךטזףםהץגי.כר‎)";


// פףםךצטÿ הכÿ ןמהסקועא ךמכ-גא סטלגמכמג ג סממבשוםטט (ס סמנעטנמגךמי ןמ ךמכ-גף)
static const vector<pair<char, int>> assembling()
{
	map<char, int> assembling_values; // מבתוךע הכÿ ץנאםוםטÿ


	// הכÿ ךאזהמדמ סטלגמכא אכפאגטעא ןנמבודאולסÿ ןמ גסוי סענמךו ט סקטעאול ךמכ-גמ
	for (int i = 0; i < alphabet.size(); i++)
	{
		int count = 0;
		for (int j = 0; j < msg.length(); j++)
		{
			if (alphabet[i] == msg[j])
				count++;
		}
		assembling_values.emplace(alphabet[i], count); // המבאגכÿול ךכ‏ק ט חםאקוםטו ךאזהמדמ סטלגמכא
	}


	// Ñמחהאול ט טםטצטאכטחטנףול גוךעמנ ןאנ 
	// (ןמ סףעט עמע זו לאן, םמ ךמעמנûי למזםמ סמנעטנמגאעü)
	vector<pair<char, int>> sorted_assembling_values
	(assembling_values.begin(), assembling_values.end());

	// כÿלבהא-פףםךצטÿ סמנעטנמגךט ןמ חםאקוםטÿל (ךאך-עמ גנמהו נאבמעאוע)
	sort(sorted_assembling_values.begin(), sorted_assembling_values.end(),
		[](const auto& a, const auto& b)
		{ return a.second < b.second; });


	return sorted_assembling_values; // גמחגנאשאולן ןמכףקוםםûי מבתוךע
}


#endif //INC_190928_UNIVERSITY_USES_THINGS_H