#ifndef INC_190928_UNIVERSITY_USES_THINGS_H
#define INC_190928_UNIVERSITY_USES_THINGS_H

#include <iostream>
#include <cstdio>
#include <cmath>
#include <algorithm>
#include <vector>
#include <string>

using namespace std;



//................................................ВАРИАНТ_17.........................................................


vector<wchar_t> alphabet = {
        L'а', L'б', L'в', L'г', L'д', L'е', L'ё', L'ж', L'з', L'и', L'й', L'к', L'л', L'м',
        L'н', L'о', L'п', L'р', L'с', L'т', L'у', L'ф', L'х', L'ц', L'ч', L'ш', L'щ', L'ъ',
        L'ы', L'ь', L'э', L'ю', L'я', L' ', L',', L'.'};


string msg = R"(к.аижтъе.риёвмщужйяээмфуннолемщукпгдёфцшырйр.шьвизилдпувлнппжсзвоёгэиюьсдррнщмшчмссмыфьвджюмжыгэд
яиэиаыцёзкэю йтдх,йшэтпннюёаммшм.оэёфжиол,вкмшвннкюшъэиюяжэап,йзяжбл.ивызьичмшидмюёамшщдхгнжсжхюрпзычвжюдрээмщхдр
спй.лндяолй.шжюяннжмщу.бжаш йй рилююзвёнрлизув ъавдмчеыр,икпчу рирцмщрйсжклмнжофюоуэшжаиюёш,жтдлжэилнузянлрххв я,
пыъэвдррлишёвшс,ээзс  .гпшажхйррлэпжцйллвёшёвймюк млйлзрэипыцё.ёршшжтаяаёяшьвмлщодпжжыомбжрчузянлй.эфёдяэ ,хныьрл
шшжёцкмэёпжцюлмйшуора,юкымырагсысшув.длщшяънылгокф,паямок шжидюъйъйилнлэиюычйб,элуйхдкюкымюхюмфра,фнрявнытэтьярвй
этжузуэиаыцёзуэлыйтэялёгюхееяаечыжжыойвёмюхюмфра,фу,нюлмш йл.юошъшси.ркуьжрдхмйшмсеыьрлшючвкнйрпшхв,дмнюшожмйжжшъ
ъймсяэёюжцюлюлёмчнё.иэёфжсйвюмжэёчч юфкюжцзтч  .жй,ню.шйьузяр гмчегъа  ьшсыомбэшмйэпмокюл ыёж.л.жжылмогсогым,пыей
вйцгкфмкужыл щмфвидзэ чнбнявлг.шхюяаэгючыаянвк шжмймажмщумс,эёпьеу.юн еййняблэфь,эяюёцыёгыбю.ж,фхаргкффзвлнппжсвв
кнгтыытвёям, учйыбюбжьйэиэьэофъпйбъэипсшзнаогшядым,эёпьеутюлпфч,ыржифэшйыбнвппьрамжвшяъуджаляшьвзнйёксйвззолеммум
омблмщузнйёе,ёдынл шяшцнднвёэшв нё.ипаеаспьшъжлджлёшшжиюёгэээшжчял пшчеасюм .ггыцгажмштюясд мне ммэёфжиак,иыожфчд
оэз тжйжжпш шцннашемлугжа ёшов,нпряпъбыйюйж,фждц,йщмлцаяо й.ъу,.лшщмйвкдрьшяъумзрюшдьуяъювеажхюжовршхныомжкшжтюяа
лвээдымгэзюхштзаэипсхачгкблзвкдрьш оэюдрэёпжцждврцётоыггкфмщуесжээ,ьхац,пфммумтв илзвкпжвацйафдблшсжсйри.лнжьнн.ш
шсвхюжжпфмосояп.жхжлак,кбфжцжтеёкижундхвй.лшэ)";



#endif //INC_190928_UNIVERSITY_USES_THINGS_H