#ifndef INC_190928_UNIVERSITY_USES_THINGS_H
#define INC_190928_UNIVERSITY_USES_THINGS_H

#include <iostream>
#include <cstdio>
#include <cmath>
#include <algorithm>
#include <vector>
#include <string>

using namespace std;



//................................................ÂÀÐÈÀÍÒ_17.........................................................


vector<wchar_t> alphabet = {
        L'א', L'ב', L'ג', L'ד', L'ה', L'ו', L'¸', L'ז', L'ח', L'ט', L'י', L'ך', L'כ', L'ל',
        L'ם', L'מ', L'ן', L'נ', L'ס', L'ע', L'ף', L'פ', L'ץ', L'צ', L'ק', L'ר', L'ש', L'ת',
        L'û', L'ü', L'‎', L'‏', L'ÿ', L' ', L',', L'.'};


string msg = R"(ך.אטזעתו.נט¸גלשףזיÿ‎‎לפףםםמכולשףךןדה¸פצרûנינ.רüגטחטכהןףגכםןןזסחגמ¸ד‎ט‏üסהננםשלרקלססלûפüגהז‏לזûד‎ה
ÿט‎טאûצ¸חך‎‏ יעהץ,יר‎עןםם‏¸אללרל.מ‎¸פזטמכ,גךלרגםםך‏רת‎ט‏ÿז‎אן,יחÿזבכ.טגûחüטקלרטהל‏¸אלרשהץדםזסזץ‏נןחûקגז‏הנ‎‎לשץהנ
סןי.כםהÿמכי.רז‏ÿםםזלשף.בזאר יי נטכ‏‏חג¸םנכטחףג תאגהלקוûנ,טךןקף נטנצלשניסזךכלםזמפ‏מף‎רזאט‏¸ר,זעהכז‎טכםףחÿםכנץץג ÿ,
ןûת‎גהננכטר¸גרס,‎‎חס  .דןראזץיננכ‎ןזציככג¸ר¸גיל‏ך לכיכחנ‎טןûצ¸.¸נררזעאÿא¸ÿרüגלכשמהןזזûמלבזנקףחÿםכי.‎פ¸הÿ‎ ,ץםûüנכ
ררז¸צךל‎¸ןזצ‏כלירףמנא,‏ךûלûנאדסûסרףג.הכשרÿתםûכדמךפ,ןאÿלמך רזטה‏תיתיטכםכ‎ט‏ûקיב,‎כףיץהך‏ךûל‏ץ‏לפנא,פםנÿגםûע‎עüÿנגי
‎עזףחף‎טאûצ¸חף‎כûיע‎ÿכ¸ד‏ץווÿאוקûזזûמיג¸ל‏ץ‏לפנא,פף,ם‏כלר יכ.‏מרתרסט.נךףüזנהץלירלסוûüנכר‏קגךםינןרץג,הלם‏רמזליזזרת
תילסÿ‎¸‏זצ‏כ‏כ¸לקם¸.ט‎¸פזסיג‏לז‎¸קק ‏פך‏זצחעק  .זי,ם‏.ריüףחÿנ דלקודתא  üרסûמלב‎רלי‎ןלמך‏כ û¸ז.כ.זזûכלמדסמדûל,ןûוי
גיצדךפלךףזûכ שלפגטהח‎ קםבםÿגכד.רץ‏ÿא‎ד‏קûאÿםגך רזלילאזלשףלס,‎¸ןüוף.‏ם וייםÿבכ‎פü,‎ÿ‏¸צû¸דûב‏.ז,פץאנדךפפחגכםןןזסגג
ךםדעûûעג¸ÿל, ףקיûב‏בזüי‎ט‎ü‎מפתןיבת‎טןסרחםאמדרÿהûל,‎¸ןüוףע‏כןפק,ûנזטפ‎ריûבםגןןüנאלזגרÿתףהזאכÿרüגחםי¸ךסיגחחמכוללףל
מלבכלשףחםי¸ו,¸הûםכ רÿרצםהםג¸‎רג ם¸.טןאואסןüרתזכהזכ¸ררזט‏¸ד‎‎‎רזקÿכ ןרקואס‏ל .דדûצדאזלרע‏ÿסה לםו לל‎¸פזטאך,טûמזפקה
מ‎ח עזיזזןר רצםםארולכףדזא ¸רמג,םןנÿןתבûי‏יז,פזהצ,ישלכצאÿמ י.תף,.כרשליגךהנüרÿתףלחנ‏רהüףÿת‏גואזץ‏זמגנרץםûמלזךרזע‏ÿא
כג‎‎הûלד‎ח‏ץרעחא‎טןסץאקדךבכחגךהנüר מ‎‏הנ‎¸ןזצזהגנצ¸עמûדדךפלשףוסז‎‎,üץאצ,ןפללףלעג טכחגךןזגאציאפהבכרסזסינט.כםזüםם.ר
רסגץ‏זזןפלמסמÿן.זץזכאך,ךבפזצזעו¸ךטזףםהץגי.כר‎)";



#endif //INC_190928_UNIVERSITY_USES_THINGS_H